Soap/fastCustomer/ORGANIZATION/ORGANIZATION_Samples/ORGANIZATION_Full.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_CUSTOMER xmlns="urn:amlyze-services:EvaluateCustomerService_v2r0">
            <CommunicationNumber>ComNr_000321</CommunicationNumber>
            <Requester>Bank_system</Requester>
            <RiskManagementCategory>FAST</RiskManagementCategory>
            <EntityType>ORGANIZATION</EntityType>
            <CustomerExtId>cust_1232</CustomerExtId>
            <Title>UAB "Dockers"</Title>
            <CustomerStatus>ACTIVE</CustomerStatus>
            <RiskLevel>HIGH</RiskLevel>
            <InitializeScreeningProcesses>
                <Process>SANCTIONS</Process>
                <Process>PEP</Process>
                <Process>ADVERSE_MEDIA</Process>
            </InitializeScreeningProcesses>
            <NationalCode>REG74121101</NationalCode>
            <ApplicationDate>2000-01-03</ApplicationDate>
            <ActivityDescription>financial activity</ActivityDescription>
            <ActivityInRestrictedRegionDescription>logistics</ActivityInRestrictedRegionDescription>
            <ApprovalDate>2000-01-03</ApprovalDate>
            <ClosingDate>2005-05-24</ClosingDate>
            <CompanyAssetValue>100000</CompanyAssetValue>
            <DoesCashDominate>true</DoesCashDominate>
            <EstablishmentDate>2001-02-23</EstablishmentDate>
            <GIIN>GIN548745122</GIIN>
            <HasMultiLayerStructure>false</HasMultiLayerStructure>
            <IncomeSourceDescription>work</IncomeSourceDescription>
            <InitialDepositAccount>LT0000000000000000</InitialDepositAccount>
            <InitialDepositAmount>10000</InitialDepositAmount>
            <InitialDepositBank>BankBank</InitialDepositBank>
            <InitialDepositCurrency>EUR</InitialDepositCurrency>
            <InitialDepositSource>Dividend</InitialDepositSource>
            <IsActualAddressDeclared>false</IsActualAddressDeclared>
            <IsAudited>false</IsAudited>
            <IsCorrespondenceAddressDeclared>true</IsCorrespondenceAddressDeclared>
            <IsDirectlyManaged>false</IsDirectlyManaged>
            <IsFinancialInstitution>false</IsFinancialInstitution>
            <IsFined>false</IsFined>
            <IsInAdverseMedia>true</IsInAdverseMedia>
            <IsLicenseRequired>true</IsLicenseRequired>
            <IsListed>false</IsListed>
            <IsRegulated>true</IsRegulated>
            <IsSanctioned>true</IsSanctioned>
            <LegalForm>LTD</LegalForm>
            <LEI>LEI54511548</LEI>
            <LicenseDescription>Licence No.4012</LicenseDescription>
            <NoMajorShareHolders>true</NoMajorShareHolders>
            <NumberOfAudits>6</NumberOfAudits>
            <NumberOfEmployees>25</NumberOfEmployees>
            <OrganizationalStructureDescription>Hierarchical</OrganizationalStructureDescription>
            <PeriodsOfAuditsInYears>3</PeriodsOfAuditsInYears>
            <PeriodsOfFiningInYears>3</PeriodsOfFiningInYears>
            <RegionOfActivityDescription>Customer service</RegionOfActivityDescription>
            <RegistrationCountry>LT</RegistrationCountry>
            <ThirdPartyServicesUsed>true</ThirdPartyServicesUsed>
            <ThirdPartyServicesUsedDescription>hosting</ThirdPartyServicesUsedDescription>
        </AMLYZE_CUSTOMER>
    </soap:Body>
</soap:Envelope>